{
  "WorkshopId": 3291913360,
  "Title": "Zone Loot List",
  "Description": "Imagine this scenario: you just finished an epic battle in a snapjaw lair, and you have corpses strewn over multiple areas. You remember seeing a sweet weapon dropped by one of them, but you can't remember which corpse it's under.\r\n\r\nThis mod shows a list of all items in an area, and lets you pick any of them to be autocollected the next time you autoexplore. Any items that you haven't already seen are hidden from the list, to avoid feeling cheaty. It's a simple and non-intrusive way to considerably speed up post-battle looting. It's inspired by [url=https://steamcommunity.com/sharedfiles/filedetails/?id=2600583668]Mark Items For Pickup[/url], but makes a few improvements:\r\n[list]\r\n[*] Uses new builtin UI elements to pick items.\r\n  [list][*]Fixed some issues spawning chests in the molting update.[/list]\r\n[*] Changed the way items are marked for autopickup\r\n  [list][*]Auto-Get nuggets is no longer required.[/list]\r\n[*] Keybinds to show the item list.\r\n  [list][*]Ability menu is (optionally) free from clutter.[/list]\r\n[*] Better item filtering for certain item types\r\n  [list][*]Hidden items, armed mines, and trash, to name a few.[/list]\r\n[/list]\r\n\r\n[h3]Keybinds[/h3]\r\n[list]\r\n[*] [b][u]Show Item List[/u][/b]: Show all known gettable items in the current area.\r\n[*] [b][u]Uninstall Mod[/u][/b]: Prepares the game files for the mod to be removed. This is not strictly necessary but it will prevent an error from showing if you try to load a game after disabling the mod.\r\n[/list]\r\n\r\n[h3]Options[/h3]\r\n[list]\r\n[*] [b][u]Show Trash/Corpses[/u][/b]: Include trash or corpses in the item list.\r\n[*] [b][u]Show Value[/u][/b]: Show a rough estimate of how valuable an item is based on its weight. This goes from red to yellow to green as things are more valuable.\r\n[*] [b][u]Use Activated Ability[/u][/b]: Add a player ability to show the menu. Useful if you don't have enough spare keys to keybind.\r\n[/list]\r\n\r\n[h3]Notes[/h3]\r\n[*] This mod is safe to install or uninstall mid-playthrough, as many times as you want.\r\n[*] Mines that you lay yourself and disarm are unable to be auto-collected. I left them in the menu because I didn't find a good way to distinguish them from disarmed enemy mines.\r\n[*] Items that you drop yourself are unable to be auto collected so they are hidden from the auto-loot list (even after I remove the DroppedByPlayer tag).\r\n[*] The above two issues may be a bug in Qud, and I have reported them to the devs.\r\n[*] I couldn't find a good way to separate stacked items, so they come in a group.\r\n[*] The source code is available on [url=https://github.com/plaidman/zone-loot-list]my github[/url].\r\n[/list]\r\n\r\n[h3]Thanks[/h3]\r\n[list]\r\n[*] [b]KarateSnoopy[/b] for the original mod and inspiration for me to kick the tires on this modding thing.\r\n[*] [b]Ceres[/b] (Shopping List) whose code I referenced to learn about the new UI elements.\r\n[*] [b]Zephyr0[/b] (Clever Girl) whose code I referenced to learn about customizing the UI elements' behavior.\r\n[*] [b]books[/b], [b]kernel[/b] and other helpful and patient modders in the discord.\r\n[*] Of course the Qud devs for making a great game and opened it up to modding.\r\n[/list]",
  "Tags": "UX,Script",
  "Visibility": "2",
  "ImagePath": "preview.png"
}